Tekla Open API Reference for Tekla Structures 2025
ViewMarkTagAttributes Properties
The View.ViewMarkTagAttributes type exposes the following members.
Properties
Name | Description
Location
 The location of the mark tag.
 (Inherited from ViewMarkBasicTagAttributes.)
Offset
 The offset of the mark tag.
 (Inherited from ViewMarkBasicTagAttributes.)
TagAlignment
 The tag text alignment.
TagContent
 The tag content.
 (Inherited from ViewMarkBasicTagAttributes.)
Top
See Also
Reference
View.ViewMarkTagAttributes Class
Tekla.Structures.Drawing Namespace